todolist/app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.person_id = 1) ORDER BY finished DESC, priority ASC
---
  def index
     new
     @tasks = Task.all

INSERT INTO `tasks` (`name`, `created_at`, `updated_at`, `priority`, `person_id`, `finished`) VALUES('rakesh', '2011-07-14 03:01:39', '2011-07-14 03:01:39', 23, 1, NULL)
SELECT * FROM `tasks` WHERE (`tasks`.person_id = 2) ORDER BY finished ASC, priority ASC
---
  def create
	@task = Task.new(params[:task])
	if @task.save
		flash[:notice] = 'Task successfully created'
		redirect_to :action => "index"
	else
		flash[:notice] = 'Failed to Create the Task'
		@tasks = Task.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2 AND (`tasks`.person_id = 1)) ORDER BY finished DESC, priority ASC
UPDATE `tasks` SET `updated_at` = '2011-07-14 03:25:57', `finished` = 1, `priority` = 10000 WHERE `id` = 2
---
  def completed
	@task = Task.find(params[:id])
	new = {:finished => true, :priority => 10000}
	@task.update_attributes{new}

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3 AND (`tasks`.person_id = 1)) ORDER BY finished DESC, priority ASC
UPDATE `tasks` SET `updated_at` = '2011-07-14 03:28:22', `finished` = 0, `priority` = 0 WHERE `id` = 2
---
  def undo_completed
	@task = Task.find(params[:id])
	new = {:finished => false, :priority => 0}
	@task.update_atrributes{new}

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 5 AND (`tasks`.person_id = 1))
DELETE FROM `tasks` WHERE `id` = 3
---
  def destroy
	@task = Task.find(params[:id])
	@task.destroy